Artillery/postTest.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 2
      arrivalRate: 10
  payload:
    path: "200objs.csv"
    fields:
      - "id"
      - "name"
      - "priceRange"
      - "healthScore"
      - "takesReservation"
      - "Monday"
      - "Tuesday"
      - "Wednesday"
      - "Thursday"
      - "Friday"
      - "Saturday"
      - "Sunday"
scenarios:
  - name: "Stress Testing"
    flow:
      - post:
          url: "/api/sidebar/restaurants/"
          json:
            id: "{{ id }}"
            name: "{{ name }}"
            priceRange: "{{ priceRange }}"
            healthScore: "{{ healthScore }}"
            takesReservation: "{{ takesReservation }}"
            Monday: "{{ Monday }}"
            Tuesday: "{{ Tuesday }}"
            Wednesday: "{{ Wednesday }}"
            Thursday: "{{ Thursday }}"
            Friday: "{{ Friday }}"
            Saturday: "{{ Saturday }}"
            Sunday: "{{ Sunday }}"
      # - get:
      #     url: "/api/sidebar/restaurants/{{ restID }}"
      # # - think: 3